import { FC, useState } from "react";

const Arz: FC = () => {
  const [open, setOpen] = useState<boolean>(false);

  return (
    <div className="my-12 relative">
      <div
        className={
          open
            ? `border-2 p-5 rounded-xl text-justify w-full overBtn`
            : `border-2 p-5 rounded-xl text-justify h-[350px] overflow-hidden w-full overBtn`
        }
      >
        <p className="w-full">
          صرافی کیف پول من بدون شک به عنوان بهترین صرافی ارزهای دیجیتال شناخته
          می شود چرا که بیش از 1,200 ارز دیجیتال مختلف را در خود جای داده و فرصت
          معامله ارزهای دیجیتال بسیاری را به کاربران خود می دهد. در این صرافی
          شما می‌توانید بیت کوین (Bitcoin)، اتریوم (ETH)، لایت کوین (Litecoin) و
          … را خرید و فروش کنید. همچنین در کنار تمامی این ها بهره بردن از
          پشتیبانی ۲۴ ساعته باعث شده تا ما همواره پاسخگوی تمامی سوالات و مشکلات
          احتمالی کاربران باشیم. کیف پول ارز دیجیتال شما در این زمان استفاده از
          صرافی کیف پول من؛ به کیف پول جداگانه‌ای نیاز ندارید و می توانید برای
          نگهداری ارزهای دیجیتال از کیف پول من استفاده کنید. ما اولین و
          معتبرترین کیف پول ایرانی ارزهای دیجیتال هستیم که با هدف کمک به کاربران
          ایرانی کار خود را آغاز کردیم. همچنین در مقالات جداگانه ما در مورد
          اینکه کیف پول ارز دیجیتال چیست؟ صحبت کردیم که می توانید با مراجعه به
          این مقالات و با یادگیری چیستی کیف پول، به خوبی از عملکرد صرافی کیف پول
          من مطلع شوید. خرید رمز ارز خرید ارز دیجیتال در ایران کار بسیار ساده‌ای
          کند است و شما کافی است تا از صرافی کیف پول من استفاده کنید تا امکان
          خرید بیش از 1000 ارز دیجیتال مختلف را داشته باشید. بدون شک تنوع ارزهای
          دیجیتال صرافی کیف پول من نه تنها در داخل کشور باعث شده بی رقیب باشد،
          بلکه از نظر تنوع ارز های دیجیتال می تواند در لیست ده صرافی برتر جهان
          نیز قرار بگیرد. خرید شت کوین عده زیادی به دنبال خرید شت کوین در ایران
          هستند اما نمی‌توانند صرافی را پیدا کنند که تنوع ارزهای بسیار زیادی
          داشته باشد و از طریق آن بتوانند برخی شت کوین ها را خریداری کنند. ما در
          صرافی کیف پول من این امکان را در اختیار تمامی کاربران قرار دادیم که
          بتوانند به بیش از هزار ارز دیجیتال مختلف دسترسی داشته باشند و برای
          معاملات خود از آن‌ها استفاده کنند. شما می توانید با مراجعه به لیست
          ارزهای دیجیتال موجود در کیف پول من هر شت کوینی که مد نظر دارید را
          انتخاب و خرید و فروش آن را شروع کنید. صرافی ارز دیجیتال صرافی کیف پول
          من از جمله معتبرترین صرافی های داخلی است که به عنوان اولین کیف پول
          ایرانی ارزهای دیجیتال شناخته می شود. شما در این صرافی می‌توانید تعداد
          بسیار زیادی ارز دیجیتال را خرید و فروش کنید. ما به صورت روزانه ارز های
          جدیدی که معرفی می‌شوند را به صرافی خود اضافه می کنیم تا کاربران ایرانی
          بتوانند در سریع ترین زمان ممکن امکان خرید و فروش این ارز های دیجیتال
          را داشته باشند. در صرافی کیف پول من امکان خرید و فروش ارزهای دیجیتالی
          مانند بیت کوین، اتریوم، دوج کوین، تتر، کاردانو، سولانو، پولکادات،
          ریپل، ترون، لایت کوین، شیبا اینو، فلوکی اینو و… وجود دارد. بهترین
          صرافی ارز دیجیتال طبق بازخوردی که ما از کاربران خود دریافت کردیم، آن
          ها صرافی کیف پول من را به عنوان بهترین صرافی ارز دیجیتال ایرانی معرفی
          کردند که مزیت‌های بسیاری در هنگام استفاده از آن برای کاربران وجود
          دارد. تنوع ارز های دیجیتال بسیار زیاد، پشتیبانی ۲۴ ساعته و سریع،
          کارمزد های مناسب و به صرفه، امکان نگهداری ارزهای دیجیتال در کیف پول
          اختصاصی و به زودی استفاده کردن از اپلیکیشن صرافی کیف پول من، از جمله
          بخشی از مزایایی است که شما در هنگام استفاده کردن از این صرافی به دست
          می آورید. تعرفه صرافی کیف پول من تعرفه نگهداری ارزهای دیجیتال و همچنین
          انتقال و دریافت ارزها صفر در صد در نظر گرفته شده است اما تعــرفه
          تبــدیل ارز به ارز ، خرید و فروش بین 0.25 درصد تا 2 درصد برای حساب های
          کاربری تریدری و عادی می باشد که این میزان کمترین کارمزد ممکن در بین
          تمامی سامانه های شخصی و صرافی ارزهای دیجیتال می باشد. امروز کیف پول من
          نقش بسیار موثری در رشد و ارتقاء کیفیت خرید و فروش ارز دیجیتال در بازار
          کشور ایران را دارد . همچنین این کیف پول دارای قابلیت های مختلفی برای
          کاهش و افزایش سطح امنیتی حساب کاربری شما را دارد به گونه ای که شما را
          قادر میسازد تا بتوانید کیف پول خود را در سطحی قرار دهید که هر نوع
          تراکنش انتقالی به وسیله تماس تلفنی مستقیم یا تایید پیامکی توسط شما
          امکان پذیر باشد .اما این تنها ویژگی کیف پول ارزهای دیجیتال نیست ، از
          مهمترین ویژگی هایی که بسیاری از کاربران ایرانی با آن مشکل دارند تبدیل
          یک ارز به تومان در لحظه می باشد ، توجه کنیم که تمامی کسانی که علاقه به
          ارزهای دیجیتال دارند به این ارزها به عنوان سرمایه گذاری و یک روش کسب
          درامد نگاه می کنند به گونه ای که میخواهند زمانی که یک ارز سود چند صد
          درصدی را داد آن را در لحظه به فروش برسانند و سود خود را از این بازار
          برداشت کنند ، اما تمامی کیف پول های سطح دنیا از این قابلیت برخوردار
          نیستند و شما قادر نیستید یک ارز دیجیتال را به فروش برسانید و عملا این
          امکان در کیف پول من کاملا برطرف گردیده و تمامی کاربران می توانند هر
          زمان که احساس کردند ارزهای خود را به دلار یا تومان تبدیل نمایند . دید
          شما آینده شماست ، اکنون می توانید آینده را لمس کنید ، کیف پول من ،
          کامل ترین صرافی رمز ارز (Cryptocurrency & Wallet) ایران با بیشترین
          تعداد ارز برای خرید و فروش آسان با قابلیت نگهداری برای بیست سال اینده
          در بالاترین امنیت ممکن . اکنون محدودیتی وجود ندارد ، در سریع ترین زمان
          ممکن با بهترین قیمت جهانی ، ارزهای دیجیتال را نظیر بیت کوین ، اتریوم ،
          دوج کوین ، شیبا ، مانا و هزاران ارز دیگر را بخرید و در کمتر از 10
          ثانیه در معتبرترین صرافی ارزهای دیجیتال ایران ارز خود را بفروشید . با
          پلتفرم کیف پول من می توانید بیش از هزار رمز ارز را نگهداری و خرید و
          فروش نمایید ، تحویل آنی ارزهای دیجیتال به همراه پشتیبانی سریع می تواند
          لذت استفاده از این صرافی را چند برابر کند. کیف پول من؛ فراتر از انتظار
          صرافی خرید ارز دیجیتال کیف پول سعی دارد تا راهی جدید در بازار ارزهای
          دیجیتال برای ایرانیان باز کند. کیف پول من همواره به دنبال پیشرفت و
          گسترش این بازار در بین ایرانیان است. در شرایطی که ارزش ارز ایران در
          حال کاهش است، استفاده از بازارهای جهانی و معامله در این بازارها
          می‌تواند به شما کمک شایانی کند. صرافی خرید و فروش ارز دیجیتال کیف پول
          من نیز سعی دارد تا هموطنان عزیز را در این راه همراهی کند. برخلاف اکثر
          فعالان و رقیبان، کیف پول من سعی دارد تا نقشی همه جانبه در بازار ارزهای
          دیجیتال بازی کند. کیف پول من علاوه بر این که بهترین سایت خرید و فروش
          ارز دیجیتال است، در دیگر زمینه‌ها نیز فعالیت درخشانی دارد. امنیت که
          واژه درخشان در دنیای ارزهای دیجیتال است، گاهی باعث از دست رفتن سرمایه
          کاربران می‌شود. امنیت ضعیف یکی از عواملی است که می‌تواند کیف پول منتخب
          شما را تهدید کند. کیف پول من با امنیت بالایی که دارد، جای مطمئن و
          مناسبی برای نگه داری ارزهای دیجیتال شما است. سایت خرید و فروش ارز
          دیجیتال کیف پول من، با ارائه اولین کیف پول معتبر ایرانی توانسته بستری
          مناسبی برای هزاران تریدر و سرمایه گذار باشد. یکی از زمینه‌های جدید
          فعالیت کیف پول من، بخش آموزشی این پلتفرم است که بهترین مطالب را در
          حوزه آموزش خرید ارز دیجیتال ارائه می‌نماید. در ادامه، بیشتر به معرفی
          کاربردهای کیف پول من و بخش مقالات صرافی ارز دیجیتال کیف پول من خواهیم
          پرداخت. کیف پول من چه کاربردی دارد؟ با دانستن کاربردهای جدید و ویژه
          کیف پول من متوجه می‌شوید که چگونه این سایت خرید و فروش ارز دیجیتال،
          فراتر از انتظار ظاهر می‌شود. در قدم اول، کیف پول من، بیش از 2000 ارز
          دیجیتال و توکن را پشتیبانی می‌کند. در دنیای امروز رمزارزها، شرکت‌ها و
          تیم‌های متعددی سعی دارند با ساخت ارز دیجیتال، پروژه‌های خود را پیشرفت
          داده یا دنیایی جدید ایجاد کنند. برای این که به عنوان اولین افراد به
          چنین ارزهای دیجیتالی دسترسی پیدا کنید، کیف پول من، بهترین ابزار برای
          خرید ارز دیجیتال خواهد بود. به طور حتم می‌دانید که اولین بودن در دنیای
          ارزهای دیجیتال، چه تاثیری در سوددهی و کسب درآمد دارد. پس با عملکردی
          هوشمندانه می‌توانید صرافی خرید و فروش ارز دیجیتال کیف پول من را انتخاب
          کرده و جزو اولین‌ها باشید. برای افرادی که در دنیای رمزارزهای فعالیت
          می‌کنند، اطلاع از قیمت ارزهای دیجیتال، یک لازمه است. قیمت لحظه ای
          ارزهای دیجیتال، می‌تواند تاثیر زیادی در سود یا ضرر معامله شما داشته
          باشد. با مشاهده قیمت لحظه ای ارزهای دیجیتال که در کمترین زمان
          بروزرسانی می‌شوند، می‌توانید معامله‌های دقیق و موفقی را تجربه کنید.
          همچنین کیف پول من با تاسیس بلاگ معتبر خود، سعی کرده تا علاوه بر آموزش
          خرید ارز دیجیتال، به پوشش اخبار لحظه‌ای این حوزه نیز بپردازد. شاید با
          بررسی قیمت لحظه‌ای ارزهای دیجیتال بتوانید، سیگنال ارز دیجیتال خوبی را
          پیدا کرده و با خرید یا فروش ارز دیجیتال مورد نظر، سود بسیار زیادی کسب
          کنید. کیف پول من با تسلط بر تمامی حوزه‌های ارز دیجیتال، بهترین مرجع
          برای تریدرهای حرفه‌ای و مبتدی است. استخراج رمز ارز یکی از بهترین
          راه‌های برای کسب درآمد از دنیای ارزهای دیجیتال شناخته می‌شود. اگر به
          جای خرید رمزارزها، به استخراج ارز دیجیتال علاقه دارید، شما را در این
          راه نیز همراهی خواهیم کرد. کیف پول من با آموزش خرید و فروش ارز
          دیجیتال، ارائه قیمت لحظه رمزارزها، سعی دارد تا تمامی افراد فعال در این
          حوزه را حمایت کند. در صورتی که با دریافت سیگنال ارز دیجیتال، متوجه
          ریزش بازار شدید، می‌توانید با خرید تتر از کیف پول من، از سرمایه خود
          محافظت کنید. کیف پول من به این دلیل بهترین سایت خرید و فروش ارز
          دیجیتال شناخته می‌شود که تمامی معاملات و تبدیل‌ها در آن، به سرعت انجام
          می‌گیرند. اگر با دنیای ارزهای دیجیتال آشنایی کافی را ندارید، بهتر است
          از مقالات آموزشی کیف پول من استفاده کنید. مقالات صرافی خرید ارز
          دیجیتال کیف پول برای تمامی افراد مبتدی تا حرفه‌ای این حوزه تهیه
          شده‌اند. شما می‌توانید با آموزش خرید و فروش ارز دیجیتال وارد دنیای
          رمزارزها شده و پس از مدت کوتاهی، به یک فرد حرفه‌ای تبدیل شوید که به
          دنبال سیگنال ارز دیجیتال است و با بررسی قیمت لحظه ای ارزهای دیجیتال،
          توانسته سود زیادی از این دنیای نوین کسب کند.
        </p>
        {open ? null : (
          <div className="absolute bottom-[2.5px] h-24 arz left-0 w-full rounded-xl mx-1"></div>
        )}
      </div>
      <div className="flex justify-center">
        <button
          className="text-white bg-primary-300 px-5 rounded-xl py-3 btn-shine absolute mt-12 font-Yek-Bold"
          onClick={() => setOpen(!open)}
        >
          {open ? "مشاهده کمتر" : "مشاهده بیشتر"}
        </button>
      </div>
    </div>
  );
};

export default Arz;
